; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-3-4-1-6-10)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos1-0 pos1-1 pos1-2 pos1-3 pos2-0 pos2-1 pos2-2 pos2-3
    shape0
    key0 key1 key2 key3 key4 key5
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (shape shape0)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)
       (key key5)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-2)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (locked pos2-1)
       (locked pos1-1)
       (locked pos2-2)
       (locked pos0-1)
       (locked pos0-2)
       (locked pos1-0)
       (locked pos0-3)
       (locked pos0-0)
       (locked pos2-0)
       (locked pos1-3)
       (lock-shape  pos2-1 shape0)
       (lock-shape  pos1-1 shape0)
       (lock-shape  pos2-2 shape0)
       (lock-shape  pos0-1 shape0)
       (lock-shape  pos0-2 shape0)
       (lock-shape  pos1-0 shape0)
       (lock-shape  pos0-3 shape0)
       (lock-shape  pos0-0 shape0)
       (lock-shape  pos2-0 shape0)
       (lock-shape  pos1-3 shape0)
       (open pos1-2)
       (open pos2-3)

       (key-shape  key0 shape0)
       (key-shape  key1 shape0)
       (key-shape  key2 shape0)
       (key-shape  key3 shape0)
       (key-shape  key4 shape0)
       (key-shape  key5 shape0)
       (at key0 pos1-3)
       (at key1 pos2-0)
       (at key2 pos1-0)
       (at key3 pos1-2)
       (at key4 pos0-1)
       (at key5 pos1-1)
       (at-robot pos1-2)
    )

    (:goal (and
       (at key0 pos1-1)
       (at key1 pos0-3)
       (at key2 pos2-0)
       (at key4 pos1-3)
       (at key5 pos0-0)
    )))

; plan
1. (pickup pos1-2 key3)
   deleted: (at key3 pos1-2) (arm-empty)
   added: (holding key3)
   goals met: 0 of 5
2. (unlock pos1-2 pos1-3 key3 shape0)
   deleted: (locked pos1-3)
   added: (open pos1-3)
   goals met: 0 of 5
3. (unlock pos1-2 pos1-1 key3 shape0)
   deleted: (locked pos1-1)
   added: (open pos1-1)
   goals met: 0 of 5
4. (move pos1-2 pos1-1)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-1)
   goals met: 0 of 5
5. (unlock pos1-1 pos0-1 key3 shape0)
   deleted: (locked pos0-1)
   added: (open pos0-1)
   goals met: 0 of 5
6. (move pos1-1 pos0-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos0-1)
   goals met: 0 of 5
7. (unlock pos0-1 pos0-0 key3 shape0)
   deleted: (locked pos0-0)
   added: (open pos0-0)
   goals met: 0 of 5
8. (pickup-and-loose pos0-1 key4 key3)
   deleted: (holding key3) (at key4 pos0-1)
   added: (holding key4) (at key3 pos0-1)
   goals met: 0 of 5
9. (move pos0-1 pos1-1)
   deleted: (at-robot pos0-1)
   added: (at-robot pos1-1)
   goals met: 0 of 5
10. (move pos1-1 pos1-2)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-2)
   goals met: 0 of 5
11. (move pos1-2 pos1-3)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-3)
   goals met: 0 of 5
12. (pickup-and-loose pos1-3 key0 key4)
   deleted: (holding key4) (at key0 pos1-3)
   added: (holding key0) (at key4 pos1-3)
   goals met: 1 of 5
13. (move pos1-3 pos1-2)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-2)
   goals met: 1 of 5
14. (move pos1-2 pos1-1)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-1)
   goals met: 1 of 5
15. (pickup-and-loose pos1-1 key5 key0)
   deleted: (holding key0) (at key5 pos1-1)
   added: (holding key5) (at key0 pos1-1)
   goals met: 2 of 5
16. (move pos1-1 pos0-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos0-1)
   goals met: 2 of 5
17. (move pos0-1 pos0-0)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-0)
   goals met: 2 of 5
18. (unlock pos0-0 pos1-0 key5 shape0)
   deleted: (locked pos1-0)
   added: (open pos1-0)
   goals met: 2 of 5
19. (putdown pos0-0 key5)
   deleted: (holding key5)
   added: (arm-empty) (at key5 pos0-0)
   goals met: 3 of 5
20. (move pos0-0 pos1-0)
   deleted: (at-robot pos0-0)
   added: (at-robot pos1-0)
   goals met: 3 of 5
21. (pickup pos1-0 key2)
   deleted: (at key2 pos1-0) (arm-empty)
   added: (holding key2)
   goals met: 3 of 5
22. (unlock pos1-0 pos2-0 key2 shape0)
   deleted: (locked pos2-0)
   added: (open pos2-0)
   goals met: 3 of 5
23. (move pos1-0 pos2-0)
   deleted: (at-robot pos1-0)
   added: (at-robot pos2-0)
   goals met: 3 of 5
24. (pickup-and-loose pos2-0 key1 key2)
   deleted: (holding key2) (at key1 pos2-0)
   added: (holding key1) (at key2 pos2-0)
   goals met: 4 of 5
25. (move pos2-0 pos1-0)
   deleted: (at-robot pos2-0)
   added: (at-robot pos1-0)
   goals met: 4 of 5
26. (move pos1-0 pos1-1)
   deleted: (at-robot pos1-0)
   added: (at-robot pos1-1)
   goals met: 4 of 5
27. (move pos1-1 pos1-2)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-2)
   goals met: 4 of 5
28. (move pos1-2 pos1-3)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-3)
   goals met: 4 of 5
29. (unlock pos1-3 pos0-3 key1 shape0)
   deleted: (locked pos0-3)
   added: (open pos0-3)
   goals met: 4 of 5
30. (move pos1-3 pos0-3)
   deleted: (at-robot pos1-3)
   added: (at-robot pos0-3)
   goals met: 4 of 5
31. (putdown pos0-3 key1)
   deleted: (holding key1)
   added: (arm-empty) (at key1 pos0-3)
   goals met: 5 of 5
